<template>
  <div class="software-license">
    <div class="software-license-header">
      <div class="software-license-title">
        <div class="software-license-first-block-svg" @click="$router.closeActivity()" :style="'background:url(\''+(require('../../assets/svg/register/arrow.svg'))+'\') center no-repeat'"></div>
        <div class="software-license-first-block-name">软件许可及服务协议</div>
      </div>
    </div>
    <div class="software-license-content">
      <div class="software-license-box">
        <h3>欢迎您使用奕桥-Park软件及服务！</h3>
          为使用本软件及服务，您应当阅读并遵守《奕桥软件许可及服务协议》（以下简称"本协议"）。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或 使用某项服务的单独协议，并选择接受或不接受。
          除非您已阅读并接受本协议所有条款，否则请勿下载、安装或使用本软件及相关服务。您的下载、安装、使用、获取帐号、登录等行为即视为您已阅读并同意上述协议的约束。
          <h4>一、协议的范围</h4>
            <p>1.1协议适用主体范围</p>
            本协议是您与奕桥之间关于您下载、安装、使用、复制本软件，以及 使用奕桥相关服务所订立的协议。
            <p>1.2协议关系及冲突条款</p>
            本协议内容包括但不限于奕桥将酌情发布的关于本软件及服务的相关 协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分 割的组成部分，您同样应当遵守。
          <h4>二、关于本服务</h4>
            <p>2.1本服务的内容</p>
            本软件服务内容是指奕桥向用户提供的移动应用工具（以下简称"应用"），为用户提供包括但不限于工位预订、会议室预订、签到、快递 通知、访客管理等功能或内容的软件许可及服务（以下简称"本服务"）。
            <p>2.2本服务的形式</p>
            <p>2.2.1您使用本服务需要下载奕桥客户端软件，对于这些软件，奕桥给予您一项个人的、不可转让及非排他性的许可。您仅可为访问或使用本服务的目的而使用这些软件及服务。</p>
            <p>2.2.2本服务中奕桥客户端软件提供包括但不限于iOS、Android等多个 应用版本，用户必须选择与所安装终端设备相匹配的软件版本。</p>
            <p>2.3本服务许可的范围</p>
            <p>2.3.1奕桥给予您一项个人的、不可转让及非排他性的许可，以使用本软件。您可以为非商业目的在单一台终端设备上安装、使用、显示、 运行本软件。</p>
            <p>2.3.2您可以为使用本软件及服务的目的复制本软件的一个副本，仅用 作备份。备份副本必须包含原软件中含有的所有著作权信息。</p>
            <p>2.3.3本条及本协议其他条款未明示授权的其他一切权利仍由奕桥保留，您在行使这些权利时须另外取得奕桥的书面许可。奕桥如果未行 使前述任何权利，并不构成对该权利的放弃。</p>
          <h4>三、软件的获取</h4>
            <p> 3.1您可以直接从奕桥的网站上获取本软件，也可以从得到奕桥授权的第三方获取。</p>
            <p> 3.2如果您从未经奕桥授权的第三方获取本软件或与本软件名称相同的安装程序，奕桥无法保证该软件能够正常使用，并对因此给您造成的损失不予负责。</p>
          <h4>四、软件的安装与卸载</h4>
            <p> 4.1奕桥可能为不同的终端设备开发了不同的软件版本，您应当根据实际情况选择下载合适的版本进行安装。</p>
            <p> 4.2下载安装程序后，您需要按照该程序提示的步骤正确安装。</p>
            <p> 4.3为提供更加优质、安全的服务，在本软件安装时奕桥可能推荐您安装其他软件，您可以选择安装或不安装。</p>
            <p> 4.4如果您不再需要使用本软件或者需要安装新版软件，可以自行卸载。如果您愿意帮助奕桥改进产品服务，请告知卸载的原因。</p>
          <h4>五、软件的更新</h4>
            <p>5.1为了改善用户体验、完善服务内容，奕桥将不断努力开发新的服务，并酌情为您不时提供软件更新（这些更新可能会采取软件替换、 修改、功能强化、版本升级等形式）。</p>
            <p>5.2为了保证本软件及服务的安全性和功能的一致性，奕桥有权不经向 您特别通知而对软件进行更新，或者对软件的部分功能效果进行改变 或限制。</p>
            <p>5.3本软件新版本发布后，旧版本的软件可能无法使用。奕桥不保证旧版本软件继续可用及相应的客户服务，请您随时核对并下载最新版本。</p>
          <h4>六、用户个人信息保护</h4>
            <p> 6.1保护用户个人信息是奕桥的一项基本原则，奕桥将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可奕桥不会向第三方公开、透露用户个人信息。奕桥对相关信息采用专业 加密存储与传输方式，保障用户个人信息的安全。</p>
            <p> 6.2您在注册帐号或使用本服务的过程中，需要提供一些必要的信息， 例如：为向您提供帐号注册服务或进行用户身份识别，需要您填写姓名、手机号等信息。若国家法律法规或政策有特殊规定的，您需要提供真实的身份信息。若您提供的信息不完整，则无法使用本服务或在使用垃程中受到限制。</p>
            <p> 6.3—般情况下，您可随时浏览、修改自己提交的信息，但出于安全性 和身份识别的考虑，您可能无法修改注册时提供的初始注册信息及其 他验证信息。</p>
            <p>6.4奕桥将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。</p>
            <p>6.5未经您的同意，奕桥不会向奕桥以外的任何公司、组织和个人披露 您的个人信息，但法律法规另有规定的除外。</p>
            <p> 6.6 若您提供信息虚假或不完整，所产生的全部法律责任由您个人承担。
          <h4>七、主权利义务条款</h4>
            <p>7.1帐号使用规范</p>
            <p> 7.1.1您在使用本服务前需要注册一个帐号。奕桥有权根据用户需求或产品需要对帐号注册方式进行变更，关于您使用帐号的具体规则，请遵守相关帐号使用协议以及奕桥为此发布的专项规则。</p>
            <p> 7.1.2帐号的所有权归奕桥公司所有，用户完成申请注册手续后，仅获得帐号的使用权，且该使用权仅属于初始申请注册人。[E.W.1] 同时，初始申请注册人不得赠与、借用、租用、转让或售卖帐号或者以其他方式许 可非初始申请注册人使用帐号。非初始申请注册人不得通过受赠、继 承、承租、受让或者其他任何方式使用帐号。</p>
            <p> 7.1.3用户有责任妥善保管注册帐户信息及帐户密码的安全，用户需要 对注册帐户以及密码下的行为承担法律责任。用户同意在任何情况下 不向他人透露帐户及密码信息。当在您怀疑他人在使用您的帐号时，您应立即通知奕桥公司。</p>
            <p>7.1.4用户注册帐号后如果长期不登录该帐号，奕桥有权回收该帐号，以免造成资源浪费，由此带来的任何损失均由用户自行承担。</p>
            <p>7.2用户注意事项</p>
            <p> 7.2.1您理解并同意：为了向您提供有效的服务，本软件会利用您终端设备的处理器和带宽等资源。本软件使用过程中可能产生数据流量的费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。</p>
            <p> 7.2.2您理解并同意：本软件的某些功能可能会让第三方知晓用户的信息。例如：短信通知时，第三方平台会调用用户手机号码；用户在APP 中可以查询其他用户头像、名字、个人资料；用户可以通过用户名、 手机号码查询和添加好友；开门功能会调用用户ID和手机号码等信</p>
            <p>7.2.3您在使用本软件某一特定服务时，该服务可能会另有单独的协议、相关业务规则等，您在使用该项服务前请阅读并同意相关的单独协议。</p>
            <p> 7.2.4您理解并同意奕桥将会尽其商业上的合理努力保障您在本软件及 服务中的数据存储安全，但是，奕桥并不能就此提供完全保证，包括但不限于以下情形：</p>
            <p> 7.2.4.1奕桥不对您在本软件及服务中相关数据的删除或储存失败负责；</p>
            <p> 7.2.4.2奕桥有权根据实际情况自行决定单个用户在本软件及服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。您可根据自己的需要自行备份本软件及服务中的相关数据；</p>
            <p>7.2.4.3如果您停止使用本软件及服务或服务被终止或取消，奕桥可以从服务器上永久地删除您的数据。服务停止、终止或取消后，奕桥没有义务向您返还任何数据。</p>
            <p> 7.2.5用户在使用本软件及服务时，须自行承担如下来自奕桥不可掌控的风险内容，包括但不限于：</p>
            <p> 7.2.5.1由于不可抗拒因素可能引起的个人信息丟失、泄漏等风险；</p>
            <p>7.2.5.2用户必须选择与所安装终端设备相匹配的软件版本，否则，由于软件与终端设备型号不相匹配所导致的任何问题或损害，均由用户自行承担；</p>
            <p>7.2.5.3用户在使用本软件访问第三方网站时，因第三方网站及相关内容所可能导致的风险，由用户自行承担；</p>
            <p>7.2.5.4用户发布的内容被他人转发、分享，因此等传播可能带来的风险和责任；</p>
            <p> 7.2.5.5由于无线网络信号不稳定、无线网络带宽小等原因，所引起的 奕桥登录失败、资料同步不完整、页面打开速度慢等风险。</p>
            <p>7.2.5.6 如发生上述问题，由用户自行承担风险，奕桥不承担任何责任，但可尽最大限度配合用户解决问题。</p>
            <p> 7.3第三方产品和服务</p>
            <p> 7.3.1您在使用本软件第三方提供的产品或服务时，除遵守本协议约定 外，还应遵守第三方的用户协议。奕桥和第三方对可能出现的纠纷在 法律规定和约定的范围内各自承担责任。</p>
            <p> 7.3.2因用户使用本软件或要求奕桥提供特定服务时，本软件可能会调用第三方系统或者通过第三方支持用户的使用或访问，使用或访问的结果由该第三方提供（包括但不限于第三方通过公众帐号提供的服务，或通过开放平台接入的内容等），奕桥不保证通过第三方提供服 务及内容的安全性、准确性、有效性及其他不确定的风险，由此若引发的任何争议及损害，与奕桥无关，奕桥不承担任何责任。</p>
            <p> 7.3.3您理解并同意，奕桥有权决定将本软件作商业用途，包括但不限于开发、使用本软件的部分服务为第三方作推广等，奕桥承诺在推广过程中严格按照本协议约定保护您的个人信息，同时您亦可以根据系统设置选择屏蔽、拒绝接收相关推广信息。</p>
          <h4>八、知识产权声明</h4>
            <p> 8.1奕桥是本软件的知识产权权利人。本软件的一切著作权、商标权、 专利权、商业秘密等知识产权，以及与本软件相关的所有信息内容 (包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的 国际条约保护，奕桥享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。</p>
            <p> 8.2未经奕桥或相关权利人书面同意，您不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。</p>
          <h4>九、终端安全责任</h4>
            <p>9.1您理解并同意，本软件同大多数互联网软件一样，可能会受多种因素影响，包括但不限于用户原因、网络服务质量、社会环境等；也可能会受各种安全问题的侵扰，包括但不限于他人非法利用用户资料，进行现实中的骚扰；用户下载安装的其他软件或访问的其他网站 中可能含有病毒、木马程序或其他恶意程序，威胁您的终端设备信息和数据安全，继而影响本软件的正常使用等。因此，您应加强信息安全及个人信息的保护意识，注意密码保护，以免遭受损失。</p>
            <p>9.2您不得制作、发布、使用、传播用于窃取帐号及他人个人信息、 财产的恶意程序。</p>
            <p> 9.3维护软件安全与正常使用是奕桥和您的共同责任，奕桥将按照行业标准合理审慎地采取必要技术措施保护您的终端设备信息和数据安全，但是您承认和同意奕桥并不能就此提供完全保证。</p>
            <p> 9.4在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意奕桥有关防范诈骗犯罪的提示。</p>
          <h4>十、其他</h4>
            <p>10.1您使用本软件即视为您已阅读并同意受本协议的约束。奕桥有权在必要时修改本协议条款。您可以在本软件的最新版本中查阅相关协 议条款。本协议条款变更后，如果您继续使用本软件，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本软件。</p>
            <p>10.2本协议签订地为中华人民共和国浙江省杭州市。</p>
            <p>10.3本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共 和国大陆地区法律（不包括冲突法）。</p>
            <p>10.4若您和奕桥之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</p>
            <p>10.5本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
            <p>10.6本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</p>
      </div>
    </div>
  </div>
</template>

<script>

  export default{
    data () {
      return {

      }
    },
    props:{
    },
    components: {
    },
    methods : {
      goClose(){
        this.$router.closeActivity()
      }
    }
  }
</script>
<style lang="less" rel="stylesheet/less">
  .software-license{
    .software-license-header{
      padding: 10px 20px 10px 20px;
      .software-license-title{
        position: relative;
        font-size: 18px;
        .software-license-first-block-svg{
          height: 30px;
          width: 30px;
          display: inline-block;
        }
        .software-license-first-block-name{
          display: inline-block;
          position: absolute;
          right: 25%;
        }
      }
    }
    .software-license-content {
      height: 100vh;
      overflow-y: scroll;
      -w-webkit-overflow-scrolling:touch;
      .software-license-box{
        padding:0 20px 60px 20px;
        font-size: 14px;
      }
    }

  }
</style>
